#### this notebook is to merge the synthetic data from LARS-WG with the climate date for crop simulation

In [1]:
#import the pandas package for 2D processing
import pandas as pd
from datetime import datetime

In [2]:
# import historic data tab deliminator 
df_hist=pd.read_csv('data/Historical.dat',delimiter='\t')

In [3]:
#show the to data lists
df_hist.head()

   YEAR  MONTH  DAY  MIN   MAX  RAIN    RAD
0  1991      1    1  7.3  14.9   0.7  3.956
1  1991      1    2  2.3  11.9   0.0  5.170
2  1991      1    3  5.0  15.4   0.1  6.312
3  1991      1    4  4.5  14.7   0.0  4.975
4  1991      1    5  5.1  14.1   0.5  5.622

In [4]:
#import the LARS-WG genereated synthetic data
df_gen=pd.read_csv('data/Generated.dat',delimiter='\t')

In [5]:
df_gen = df_gen.reset_index()

In [6]:
#get the column names
gen_cols=df_gen.columns
gen_cols

Index(['level_0', 'level_1', 'YEAR', 'DOY     MIN', 'MAX', 'RAIN', 'RAD'], dtype='object')

In [7]:
#select the columns
df_gen=df_gen[['level_0','level_1','YEAR','DOY     MIN','MAX','RAIN']]

In [8]:
#swap columns to their exact data
gen_cols = ['YEAR', 'DOY','MIN', 'MAX', 'RAIN', 'RAD']

In [9]:
#assign the new columns to the dataframe
df_gen.columns=gen_cols

In [10]:
df_gen #

       YEAR  DOY   MIN   MAX  RAIN  RAD
0         1    1  10.6  10.8   0.0  7.9
1         1    2   2.3  17.3   0.0  8.4
2         1    3   3.9  14.1   0.0  8.4
3         1    4   6.7  16.6   0.0  8.8
4         1    5   6.7  16.8   0.0  8.7
...     ...  ...   ...   ...   ...  ...
36495   100  361   1.7  16.6   0.2  6.2
36496   100  362   3.3  13.0   0.1  6.9
36497   100  363   5.5  13.5   0.0  5.8
36498   100  364   3.7  11.2   0.0  8.0
36499   100  365   7.0  12.6   0.4  1.8

[36500 rows x 6 columns]

In [11]:
boe=day_of_year = datetime.now().timetuple().tm_yday

In [12]:
datetime.now()

datetime.datetime(2024, 10, 28, 18, 36, 54, 497734)

In [13]:
# pick your lead time start and end to contact the generated data to the clim data
lead_start='1991-02-01'
lead_end='1991-06-30'

In [14]:
#change to a datetime format 
lead_start = pd.to_datetime(lead_start)
lead_end = pd.to_datetime(lead_end)

In [15]:
#get the day of year
l_start=lead_start.timetuple().tm_yday
l_end = lead_end.timetuple().tm_yday
print("the start and end day of the year:",l_start,'up to',l_end)

the start and end day of the year: 32 up to 181

In [16]:
#filetr genereated 1 in Year column and slice the day of the year from l_start to l_end
df_gen[(df_gen['YEAR']==1 ) & (df_gen['DOY'].between(l_start, l_end))]

     YEAR  DOY   MIN   MAX  RAIN   RAD
31      1   32   9.2  14.5   0.2   5.8
32      1   33  -2.9  13.9   0.1   3.8
33      1   34   4.6   8.8   5.1   7.4
34      1   35   4.8  11.2   0.5   7.0
35      1   36   7.0  15.8   0.0   7.6
..    ...  ...   ...   ...   ...   ...
176     1  177  18.9  27.2   0.0  27.3
177     1  178  13.0  30.2   0.0  26.1
178     1  179  11.8  30.4   0.0  30.9
179     1  180  16.2  30.0   0.0  29.8
180     1  181  16.7  30.2   1.3  22.2

[150 rows x 6 columns]

In [17]:
df_hist.columns

Index(['YEAR', 'MONTH', 'DAY', 'MIN', 'MAX', 'RAIN', 'RAD'], dtype='object')

In [18]:
#rename the column in historic data DAY to DOY 
df_hist=df_hist.rename(columns={'DAY':'DOY'})

In [19]:
#Join the dataframes df_hist and df_gen to df_main
data = []
for yr in df_hist.YEAR.unique():
    for i in range(1,101):
        df_1=df_hist[(df_hist['YEAR']==yr ) & (df_hist['MONTH']==1)]
        df_1=df_1[['YEAR','DOY','MIN','MAX','RAIN','RAD']]
        df_2 = df_gen[(df_gen['YEAR']==i ) & (df_gen['DOY'].between(l_start, l_end))]
        df_sub=pd.concat([df_1,df_2],ignore_index=True)
        df_sub['YEAR']=yr
        df_sub.values.tolist()
        data.append(df_sub)
df_main=pd.concat(data)

In [20]:
#ready to export the dataframe 
df_main

     YEAR  DOY   MIN   MAX  RAIN     RAD
0    1991    1   7.3  14.9   0.7   3.956
1    1991    2   2.3  11.9   0.0   5.170
2    1991    3   5.0  15.4   0.1   6.312
3    1991    4   4.5  14.7   0.0   4.975
4    1991    5   5.1  14.1   0.5   5.622
..    ...  ...   ...   ...   ...     ...
176  2020  177  10.9  24.3   0.0  26.100
177  2020  178  18.5  29.6   0.0  28.400
178  2020  179  14.6  20.0   9.5  18.500
179  2020  180  22.3  24.5   0.0  29.200
180  2020  181  17.8  25.9   0.0  31.100

[543000 rows x 6 columns]

In [23]:
df_main_yrl=df_main.groupby(['DOY']).mean()[df_main.columns[2:]].reset_index()
df_main_yrl

     DOY        MIN        MAX      RAIN        RAD
0      1   3.596667  12.710000  1.520000   5.672633
1      2   3.776667  12.066667  2.053333   4.883967
2      3   4.446667  12.313333  0.460000   5.756633
3      4   3.080000  11.476667  1.370000   5.063733
4      5   3.080000  12.160000  1.813333   5.932767
..   ...        ...        ...       ...        ...
176  177  16.112000  28.209000  0.593000  25.751000
177  178  16.665000  29.091000  0.560000  26.482000
178  179  16.030000  29.213000  0.335000  25.861000
179  180  16.272000  29.243000  0.586000  26.145000
180  181  15.977000  29.374000  0.669000  25.529000

[181 rows x 5 columns]

In [ ]:
# uncomment to export to csv
#df_main_yrl.to_csv('/data/merged.csv')